<a href="https://colab.research.google.com/github/nikitosik258/collab/blob/main/%D0%9E%D1%80%D0%BB%D0%BE%D0%B2_%D0%9D_%D0%98%D0%92%D0%A2_363_(2_%D0%B7%D0%B0%D0%BD%D1%8F%D1%82%D0%B8%D0%B5).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# исходное число записей и последовательность для нумерации
N <- 100
Nrow <- 1:N

In [ ]:
# формирование вектора случайно сгенерированных имен
gen_name <- function(x) {
  # lists of names examples
  name_list <- c("Erick", "Kenny", "Kyle", "Stan", "Butters")
  surname_list<- c("Cartman", "McCormick", "Broflovski", "Marsh", "Stotch")
  
  names_len <- length(name_list)
  
  emp_name <- paste(
    name_list[sample(1:names_len, 1)], 
    surname_list[sample(1:names_len, 1)]
  )
  emp_name
}

Name <- sapply(Nrow, gen_name)

In [ ]:
# остальные вектора
gen_empl_year <- function(birthday) {
  sample((birthday + 18):2000, 1)
}

BirthYear <- sample(1987:1997, N, replace=T)

EmployYear <- sapply(BirthYear, gen_empl_year)

Salary <- sample(10000:30000, N, replace=T)

In [ ]:
# собираем датафрейм и выводим его
df <- data.frame(
  Nrow=Nrow,
  Name=Name,
  BirthYear=BirthYear,
  EmployYear=EmployYear,
  Salary=Salary
)

head(df)

  Nrow Name             BirthYear EmployYear Salary
1 1    Butters Cartman  1988      2001       22924
2 2    Kenny Broflovski 1989      2000       28005
3 3    Kyle Marsh       1992      2000       18800
4 4    Stan Cartman     1993      2007       10367
5 5    Kyle Stotch      1994      2012       24014
6 6    Erick Broflovski 1996      2010       15529

In [ ]:
salary_cmp_count <- nrow(df[df$Salary > 15000,])
cat(sprintf("Число сотрудников с зарплатой, больше 15000: %i", salary_cmp_count))

Число сотрудников с зарплатой, больше 15000: 73

In [ ]:
# расчет суммарного подоходного налога за все время работы в организации
currrent_year <- as.numeric(format(Sys.Date(), format="%Y"))
df$TotalIncomeTax <- with(df, (currrent_year - EmployYear)*Salary*0.13)

# финальный результат
head(df)

  Nrow Name             BirthYear EmployYear Salary TotalIncomeTax
1 1    Butters Cartman  1988      2001       22924  62582.52
2 2    Kenny Broflovski 1989      2000       28005  80094.30
3 3    Kyle Marsh       1992      2000       18800  53768.00
4 4    Stan Cartman     1993      2007       10367  20215.65
5 5    Kyle Stotch      1994      2012       24014  31218.20
6 6    Erick Broflovski 1996      2010       15529  24225.24